from flask import Blueprint, render_template

# ==============================================================================
# Blueprintの定義
# ==============================================================================
two_bp = Blueprint("two_app", __name__, url_prefix="/two") # __name__はこのファイルの名前を指す。url_prefixはURLの先頭に付ける文字列（URLプレフィックス）を指定するもの（つまり、URLの先頭に/oneが付く）

# ==============================================================================
# ルーティング
# ==============================================================================
@two_bp.route("/")
def show_template():
    return render_template("two/index.html") # render_template関数を使って、テンプレートを表示

