from flask import Blueprint, render_template

# ==============================================================================
# Blueprintの定義
# ==============================================================================
one_bp = Blueprint("one_app", __name__, url_prefix="/one") # __name__はこのファイルの名前を指す。url_prefixはURLの先頭に付ける文字列（URLプレフィックス）を指定するもの（つまり、URLの先頭に/oneが付く）

# ==============================================================================
# ルーティング
# ==============================================================================
@one_bp.route("/")
def show_template():
    return render_template("one/index.html") # render_template関数を使って、テンプレートを表示

